simulatoins/template/system/blockMeshDict

// User: bsp
// Mesh generated on 04/24/2022 23:57:47

// c = 3
// t = 1
// lf = -6
// lw = 6
// ht = 6
// hb = -6
// alpha = -10
// n_foil = 40
// n_north = 30
// n_east = 30
// n_south = 30
// n_west = 30
// e_foil = 1
// e_north = 5
// e_east = 6
// e_south = 5
// e_west = 10

FoamFile
{
 version 2.0;
 format  ascii;
 class   dictionary;
 object  blockMeshDict;
}

convertToMeters  1.0;

vertices
(
    ( 2.954423259036624 -0.520944533000791 -0.05) // 0
    ( 0.17364817766693033 0.984807753012208 -0.05) // 1
    ( -2.954423259036624 0.520944533000791 -0.05) // 2
    ( -0.17364817766693033 -0.984807753012208 -0.05) // 3
    ( 6 -0.520944533000791 -0.05) // 4
    ( 6 6 -0.05) // 5
    ( 2.954423259036624 6 -0.05) // 6
    ( 0.17364817766693033 6 -0.05) // 7
    ( -2.954423259036624 6 -0.05) // 8
    ( -6 6 -0.05) // 9
    ( -6 0.520944533000791 -0.05) // 10
    ( -6 -6 -0.05) // 11
    ( -2.954423259036624 -6 -0.05) // 12
    ( -0.17364817766693033 -6 -0.05) // 13
    ( 2.954423259036624 -6 -0.05) // 14
    ( 6 -6 -0.05) // 15
    ( 2.954423259036624 -0.520944533000791 0.05) // 16
    ( 0.17364817766693033 0.984807753012208 0.05) // 17
    ( -2.954423259036624 0.520944533000791 0.05) // 18
    ( -0.17364817766693033 -0.984807753012208 0.05) // 19
    ( 6 -0.520944533000791 0.05) // 20
    ( 6 6 0.05) // 21
    ( 2.954423259036624 6 0.05) // 22
    ( 0.17364817766693033 6 0.05) // 23
    ( -2.954423259036624 6 0.05) // 24
    ( -6 6 0.05) // 25
    ( -6 0.520944533000791 0.05) // 26
    ( -6 -6 0.05) // 27
    ( -2.954423259036624 -6 0.05) // 28
    ( -0.17364817766693033 -6 0.05) // 29
    ( 2.954423259036624 -6 0.05) // 30
    ( 6 -6 0.05) // 31
);

blocks
(
    // block 0
   hex (0 4 5 6 16 20 21 22) (30 30 1) simpleGrading ( 6 5 1)
    // block 1
   hex (0 6 7 1 16 22 23 17) (30 40 1) simpleGrading ( 5 1 1)
    // block 2
   hex (1 7 8 2 17 23 24 18) (30 40 1) simpleGrading ( 5 1 1)
    // block 3
   hex (2 8 9 10 18 24 25 26) (30 30 1) simpleGrading ( 5 10 1)
    // block 4
   hex (2 10 11 12 18 26 27 28) (30 30 1) simpleGrading ( 10 5 1)
    // block 5
   hex (2 12 13 3 18 28 29 19) (30 40 1) simpleGrading ( 5 1 1)
    // block 6
   hex (3 13 14 0 19 29 30 16) (30 40 1) simpleGrading ( 5 1 1)
    // block 7
   hex (0 14 15 4 16 30 31 20) (30 30 1) simpleGrading ( 5 6 1)
);



boundary
(
 inlet
 {
     type patch;
     faces
     (
         (9 25 26 10)
         (10 26 27 11)
     );
 }
 outlet
 {
     type patch;
     faces
     (
         (15 31 20 4)
         (4 20 21 5)
     );
 }
 airfoil
 {
     type wall;
     faces
     (
         (0 16 17 1)
         (1 17 18 2)
         (2 18 19 3)
         (3 19 16 0)
     );
 }
 top
 {
     type symmetryPlane;
     faces
     (
         (5 22 21 6)
         (6 23 22 7)
         (7 24 23 8)
         (8 25 24 9)
     );
 }
 bottom
 {
     type symmetryPlane;
     faces
     (
         (11 27 28 12)
         (12 28 29 13)
         (13 29 30 14)
         (14 30 31 15)
     );
 }

);
